cases/chpt4-forces-Buoy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    sym
    {
        type            symmetry;
    }
    btm
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
//        type            pressureInletOutletVelocity;
//        value           uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    wallTube
    {
        type            noSlip;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
